CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_rcu.h
/*!
    \file    gd32a50x_rcu.h
    \brief   definitions for the RCU

    \version 2024-12-06, V1.4.0, firmware for GD32A50x
*/

/*
    Copyright (c) 2024, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A50X_RCU_H
#define GD32A50X_RCU_H

#include "gd32a50x.h"

/* RCU definitions */
#define RCU                             RCU_BASE                              /*!< RCU base address */

/* registers definitions */
#define RCU_CTL                         REG32(RCU + 0x00000000U)              /*!< control register */
#define RCU_CFG0                        REG32(RCU + 0x00000004U)              /*!< clock configuration register 0 */
#define RCU_INT                         REG32(RCU + 0x00000008U)              /*!< clock interrupt register */
#define RCU_APB2RST                     REG32(RCU + 0x0000000CU)              /*!< APB2 reset register */
#define RCU_APB1RST                     REG32(RCU + 0x00000010U)              /*!< APB1 reset register */
#define RCU_AHBEN                       REG32(RCU + 0x00000014U)              /*!< AHB1 enable register */
#define RCU_APB2EN                      REG32(RCU + 0x00000018U)              /*!< APB2 enable register */
#define RCU_APB1EN                      REG32(RCU + 0x0000001CU)              /*!< APB1 enable register */
#define RCU_BDCTL                       REG32(RCU + 0x00000020U)              /*!< backup domain control register */
#define RCU_RSTSCK                      REG32(RCU + 0x00000024U)              /*!< reset source / clock register */
#define RCU_AHBRST                      REG32(RCU + 0x00000028U)              /*!< AHB reset register */
#define RCU_CFG1                        REG32(RCU + 0x0000002CU)              /*!< clock configuration register 1 */
#define RCU_CFG2                        REG32(RCU + 0x00000030U)              /*!< clock configuration register 2 */
#define RCU_VKEY                        REG32(RCU + 0x00000100U)              /*!< voltage key register */
#define RCU_DSV                         REG32(RCU + 0x00000134U)              /*!< deep-sleep mode voltage register */

/* bits definitions */
/* RCU_CTL */
#define RCU_CTL_IRC8MEN                 BIT(0)                                /*!< internal high speed oscillator enable */
#define RCU_CTL_IRC8MSTB                BIT(1)                                /*!< IRC8M high speed internal oscillator stabilization flag */
#define RCU_CTL_IRC8MADJ                BITS(3,7)                             /*!< internal 8M RC oscillator clock trim adjust value */
#define RCU_CTL_IRC8MCALIB              BITS(8,15)                            /*!< internal 8M RC oscillator calibration value */
#define RCU_CTL_HXTALEN                 BIT(16)                               /*!< external high speed oscillator enable */
#define RCU_CTL_HXTALSTB                BIT(17)                               /*!< external crystal oscillator clock stabilization flag */
#define RCU_CTL_HXTALBPS                BIT(18)                               /*!< external crystal oscillator clock bypass mode enable */
#define RCU_CTL_CKMEN                   BIT(19)                               /*!< HXTAL clock monitor enable */
#define RCU_CTL_PLLMEN                  BIT(20)                               /*!< PLL clock monitor enable */
#define RCU_CTL_LCKMEN                  BIT(21)                               /*!< LXTAL clock monitor enable */
#define RCU_CTL_HXTALSCAL               BIT(22)                               /*!< HXTAL frequency scale select */
#define RCU_CTL_PLLEN                   BIT(24)                               /*!< PLL enable */
#define RCU_CTL_PLLSTB                  BIT(25)                               /*!< PLL clock stabilization flag */

/* RCU_CFG0 */
#define RCU_CFG0_SCS                    BITS(0,1)                             /*!< system clock switch */
#define RCU_CFG0_SCSS                   BITS(2,3)                             /*!< system clock switch status */
#define RCU_CFG0_AHBPSC                 BITS(4,7)                             /*!< AHB prescaler selection */
#define RCU_CFG0_APB1PSC                BITS(8,10)                            /*!< APB1 prescaler selection */
#define RCU_CFG0_APB2PSC                BITS(11,13)                           /*!< APB2 prescaler selection */
#define RCU_CFG0_PLLSEL                 BIT(16)                               /*!< PLL clock source selection */
#define RCU_CFG0_DPLL                   BIT(17)                               /*!< double PLL clock */
#define RCU_CFG0_PLLMF                  BITS(18,21)                           /*!< PLL clock multiplication factor */
#define RCU_CFG0_CKOUTSEL               BITS(24,26)                           /*!< CKOUT clock source selection */
#define RCU_CFG0_PLLMF_4                BIT(27)                               /*!< bit 4 of PLLMF */
#define RCU_CFG0_CKOUTDIV               BITS(28,30)                           /*!< CK_OUT divider which the CK_OUT frequency can be reduced */
#define RCU_CFG0_PLLDV                  BIT(31)                               /*!< CK_PLL divide by 1 or 2 for CK_OUT */

/* RCU_INT */
#define RCU_INT_IRC40KSTBIF             BIT(0)                                /*!< IRC40K stabilization interrupt flag */
#define RCU_INT_LXTALSTBIF              BIT(1)                                /*!< LXTAL stabilization interrupt flag */
#define RCU_INT_IRC8MSTBIF              BIT(2)                                /*!< IRC8M stabilization interrupt flag */
#define RCU_INT_HXTALSTBIF              BIT(3)                                /*!< HXTAL stabilization interrupt flag */
#define RCU_INT_PLLSTBIF                BIT(4)                                /*!< PLL stabilization interrupt flag */
#define RCU_INT_LCKMIF                  BIT(5)                                /*!< LXTAL clock monitor interrupt flag */
#define RCU_INT_PLLMIF                  BIT(6)                                /*!< PLL clock monitor interrupt flag */
#define RCU_INT_CKMIF                   BIT(7)                                /*!< HXTAL clock stuck interrupt flag */
#define RCU_INT_IRC40KSTBIE             BIT(8)                                /*!< IRC40K stabilization interrupt enable */
#define RCU_INT_LXTALSTBIE              BIT(9)                                /*!< LXTAL stabilization interrupt enable */
#define RCU_INT_IRC8MSTBIE              BIT(10)                               /*!< IRC8M stabilization interrupt enable */
#define RCU_INT_HXTALSTBIE              BIT(11)                               /*!< HXTAL stabilization interrupt enable */
#define RCU_INT_PLLSTBIE                BIT(12)                               /*!< PLL stabilization interrupt enable */
#define RCU_INT_LCKMIE                  BIT(13)                               /*!< LXTAL clock monitor interrupt enable */
#define RCU_INT_PLLMIE                  BIT(14)                               /*!< PLL clock monitor interrupt enable */
#define RCU_INT_IRC40KSTBIC             BIT(16)                               /*!< IRC40K stabilization interrupt clear */
#define RCU_INT_LXTALSTBIC              BIT(17)                               /*!< LXTAL stabilization interrupt clear */
#define RCU_INT_IRC8MSTBIC              BIT(18)                               /*!< IRC8M stabilization interrupt clear */
#define RCU_INT_HXTALSTBIC              BIT(19)                               /*!< HXTAL stabilization interrupt clear */
#define RCU_INT_PLLSTBIC                BIT(20)                               /*!< PLL stabilization interrupt clear */
#define RCU_INT_LCKMIC                  BIT(21)                               /*!< LXTAL clock monitor interrupt clear */
#define RCU_INT_PLLMIC                  BIT(22)                               /*!< PLL clock monitor interrupt clear */
#define RCU_INT_CKMIC                   BIT(23)                               /*!< HXTAL clock stuck interrupt clear */

/* RCU_APB2RST */
#define RCU_APB2RST_CFGRST              BIT(0)                                /*!< system configuration reset */
#define RCU_APB2RST_CMPRST              BIT(1)                                /*!< comparator reset */
#define RCU_APB2RST_ADC0RST             BIT(9)                                /*!< ADC0 reset */
#define RCU_APB2RST_ADC1RST             BIT(10)                               /*!< ADC1 reset */
#define RCU_APB2RST_TIMER0RST           BIT(11)                               /*!< TIMER0 reset */
#define RCU_APB2RST_SPI0RST             BIT(12)                               /*!< SPI0 reset */
#define RCU_APB2RST_TIMER7RST           BIT(13)                               /*!< TIMER7 reset */
#define RCU_APB2RST_USART0RST           BIT(14)                               /*!< USART0 reset */
#define RCU_APB2RST_TIMER19RST          BIT(20)                               /*!< TIMER19 reset */
#define RCU_APB2RST_TIMER20RST          BIT(21)                               /*!< TIMER20 reset */
#define RCU_APB2RST_CAN0RST             BIT(30)                               /*!< CAN0 reset */
#define RCU_APB2RST_CAN1RST             BIT(31)                               /*!< CAN1 reset */

/* RCU_APB1RST */
#define RCU_APB1RST_TIMER1RST           BIT(0)                                /*!< TIMER1 reset */
#define RCU_APB1RST_TIMER5RST           BIT(4)                                /*!< TIMER5 reset */
#define RCU_APB1RST_TIMER6RST           BIT(5)                                /*!< TIMER6 reset */
#define RCU_APB1RST_WWDGTRST            BIT(11)                               /*!< WWDGT reset */
#define RCU_APB1RST_SPI1RST             BIT(14)                               /*!< SPI1 reset */
#define RCU_APB1RST_USART1RST           BIT(17)                               /*!< USART1 reset */
#define RCU_APB1RST_USART2RST           BIT(18)                               /*!< USART2 reset */
#define RCU_APB1RST_I2C0RST             BIT(21)                               /*!< I2C0 reset */
#define RCU_APB1RST_I2C1RST             BIT(22)                               /*!< I2C1 reset */
#define RCU_APB1RST_PMURST              BIT(28)                               /*!< PMU reset */
#define RCU_APB1RST_DACRST              BIT(29)                               /*!< DAC reset */

