CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_rcu.h
/* RCU_AHBEN */
#define RCU_AHBEN_DMA0EN                BIT(0)                                /*!< DMA0 clock enable */
#define RCU_AHBEN_DMA1EN                BIT(1)                                /*!< DMA1 clock enable */
#define RCU_AHBEN_SRAMSPEN              BIT(2)                                /*!< SRAM clock enable when sleep mode */
#define RCU_AHBEN_DMAMUXEN              BIT(3)                                /*!< DMAMUX clock enable */
#define RCU_AHBEN_FMCSPEN               BIT(4)                                /*!< FMC clock enable when sleep mode */
#define RCU_AHBEN_CRCEN                 BIT(6)                                /*!< CRC clock enable */
#define RCU_AHBEN_MFCOMEN               BIT(14)                               /*!< MFCOM clock enable */
#define RCU_AHBEN_PAEN                  BIT(17)                               /*!< GPIOA clock enable */
#define RCU_AHBEN_PBEN                  BIT(18)                               /*!< GPIOB clock enable */
#define RCU_AHBEN_PCEN                  BIT(19)                               /*!< GPIOC clock enable */
#define RCU_AHBEN_PDEN                  BIT(20)                               /*!< GPIOD clock enable */
#define RCU_AHBEN_PEEN                  BIT(21)                               /*!< GPIOE clock enable */
#define RCU_AHBEN_PFEN                  BIT(22)                               /*!< GPIOF clock enable */

/* RCU_APB2EN */
#define RCU_APB2EN_CFGEN                BIT(0)                                /*!< System configuration clock enable */
#define RCU_APB2EN_CMPEN                BIT(1)                                /*!< Comparator clock enable */
#define RCU_APB2EN_ADC0EN               BIT(9)                                /*!< ADC0 clock enable */
#define RCU_APB2EN_ADC1EN               BIT(10)                               /*!< ADC1 clock enable */
#define RCU_APB2EN_TIMER0EN             BIT(11)                               /*!< TIMER0 clock enable */
#define RCU_APB2EN_SPI0EN               BIT(12)                               /*!< SPI0 clock enable */
#define RCU_APB2EN_TIMER7EN             BIT(13)                               /*!< TIMER7 clock enable */
#define RCU_APB2EN_USART0EN             BIT(14)                               /*!< USART0 clock enable */
#define RCU_APB2EN_TIMER19EN            BIT(20)                               /*!< TIMER19 clock enable */
#define RCU_APB2EN_TIMER20EN            BIT(21)                               /*!< TIMER20 clock enable */
#define RCU_APB2EN_TRIGSELEN            BIT(29)                               /*!< TRIGSEL clock enable */
#define RCU_APB2EN_CAN0EN               BIT(30)                               /*!< CAN0 clock enable */
#define RCU_APB2EN_CAN1EN               BIT(31)                               /*!< CAN1 clock enable */

/* RCU_APB1EN */
#define RCU_APB1EN_TIMER1EN             BIT(0)                                /*!< TIMER1 clock enable */
#define RCU_APB1EN_TIMER5EN             BIT(4)                                /*!< TIMER5 clock enable */
#define RCU_APB1EN_TIMER6EN             BIT(5)                                /*!< TIMER6 clock enable */
#define RCU_APB1EN_WWDGTEN              BIT(11)                               /*!< WWDGT clock enable */
#define RCU_APB1EN_SPI1EN               BIT(14)                               /*!< SPI1 clock enable */
#define RCU_APB1EN_USART1EN             BIT(17)                               /*!< USART1 clock enable */
#define RCU_APB1EN_USART2EN             BIT(18)                               /*!< USART2 clock enable */
#define RCU_APB1EN_I2C0EN               BIT(21)                               /*!< I2C0 clock enable */
#define RCU_APB1EN_I2C1EN               BIT(22)                               /*!< I2C1 clock enable */
#define RCU_APB1EN_BKPEN                BIT(27)                               /*!< Back-up interface clock enable */
#define RCU_APB1EN_PMUEN                BIT(28)                               /*!< PMU clock enable */
#define RCU_APB1EN_DACEN                BIT(29)                               /*!< DAC clock enable */

/* RCU_BDCTL */
#define RCU_BDCTL_LXTALEN               BIT(0)                                /*!< LXTAL enable */
#define RCU_BDCTL_LXTALSTB              BIT(1)                                /*!< low speed crystal oscillator stabilization flag */
#define RCU_BDCTL_LXTALBPS              BIT(2)                                /*!< LXTAL bypass mode enable */
#define RCU_BDCTL_LXTALDRI              BITS(3,4)                             /*!< LXTAL drive capability */
#define RCU_BDCTL_RTCSRC                BITS(8,9)                             /*!< RTC clock entry selection */
#define RCU_BDCTL_RTCEN                 BIT(15)                               /*!< RTC clock enable */
#define RCU_BDCTL_BKPRST                BIT(16)                               /*!< backup domain reset */

/* RCU_RSTSCK */
#define RCU_RSTSCK_IRC40KEN             BIT(0)                                /*!< IRC40K enable */
#define RCU_RSTSCK_IRC40KSTB            BIT(1)                                /*!< IRC40K stabilization flag */
#define RCU_RSTSCK_LOCKUPRSTEN          BIT(10)                               /*!< CPU Lock-Up reset enable */
#define RCU_RSTSCK_LVDRSTEN             BIT(11)                               /*!< low voltage detection reset enable */
#define RCU_RSTSCK_ECCRSTEN             BIT(12)                               /*!< ECC 2 bits error reset enable*/
#define RCU_RSTSCK_LOHRSTEN             BIT(13)                               /*!< lost of HXTAL reset enable */
#define RCU_RSTSCK_LOPRSTEN             BIT(14)                               /*!< lost of PLL reset enable */
#define RCU_RSTSCK_BORRSTF              BIT(17)                               /*!< BOR reset flag */
#define RCU_RSTSCK_LOCKUPRSTF           BIT(18)                               /*!< CPU Lock-Up error reset flag */
#define RCU_RSTSCK_LVDRSTF              BIT(19)                               /*!< low Voltage detect error reset flag */
#define RCU_RSTSCK_ECCRSTF              BIT(20)                               /*!< two bit ECC error reset flag */
#define RCU_RSTSCK_LOHRSTF              BIT(21)                               /*!< lost of HXTAL error reset flag */
#define RCU_RSTSCK_LOPRSTF              BIT(22)                               /*!< lost of PLL error reset flag */
#define RCU_RSTSCK_V11RSTF              BIT(23)                               /*!< 1.1V domain power reset flag */
#define RCU_RSTSCK_RSTFC                BIT(24)                               /*!< reset flag clear */
#define RCU_RSTSCK_OBLRSTF              BIT(25)                               /*!< option byte loader reset flag */
#define RCU_RSTSCK_EPRSTF               BIT(26)                               /*!< external pin reset flag */
#define RCU_RSTSCK_PORRSTF              BIT(27)                               /*!< power reset flag */
#define RCU_RSTSCK_SWRSTF               BIT(28)                               /*!< software reset flag */
#define RCU_RSTSCK_FWDGTRSTF            BIT(29)                               /*!< free watchdog timer reset flag */
#define RCU_RSTSCK_WWDGTRSTF            BIT(30)                               /*!< window watchdog timer reset flag */
#define RCU_RSTSCK_LPRSTF               BIT(31)                               /*!< low-power reset flag */

