CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_rcu.h
/* PLL clock multiplication factor */
#define PLLMF_4                         RCU_CFG0_PLLMF_4                     /*!< bit 4 of PLLMF */
#define CFG0_PLLMF(regval)              (BITS(18,21) & ((uint32_t)(regval) << 18))
#define RCU_PLL_MUL2                    CFG0_PLLMF(0)                        /*!< PLL clock source multiply by 2 */
#define RCU_PLL_MUL3                    CFG0_PLLMF(1)                        /*!< PLL clock source multiply by 3 */
#define RCU_PLL_MUL4                    CFG0_PLLMF(2)                        /*!< PLL clock source multiply by 4 */
#define RCU_PLL_MUL5                    CFG0_PLLMF(3)                        /*!< PLL clock source multiply by 5 */
#define RCU_PLL_MUL6                    CFG0_PLLMF(4)                        /*!< PLL clock source multiply by 6 */
#define RCU_PLL_MUL7                    CFG0_PLLMF(5)                        /*!< PLL clock source multiply by 7 */
#define RCU_PLL_MUL8                    CFG0_PLLMF(6)                        /*!< PLL clock source multiply by 8 */
#define RCU_PLL_MUL9                    CFG0_PLLMF(7)                        /*!< PLL clock source multiply by 9 */
#define RCU_PLL_MUL10                   CFG0_PLLMF(8)                        /*!< PLL clock source multiply by 10 */
#define RCU_PLL_MUL11                   CFG0_PLLMF(9)                        /*!< PLL clock source multiply by 11 */
#define RCU_PLL_MUL12                   CFG0_PLLMF(10)                       /*!< PLL clock source multiply by 12 */
#define RCU_PLL_MUL13                   CFG0_PLLMF(11)                       /*!< PLL clock source multiply by 13 */
#define RCU_PLL_MUL14                   CFG0_PLLMF(12)                       /*!< PLL clock source multiply by 14 */
#define RCU_PLL_MUL15                   CFG0_PLLMF(13)                       /*!< PLL clock source multiply by 15 */
#define RCU_PLL_MUL16                   CFG0_PLLMF(14)                       /*!< PLL clock source multiply by 16 */
#define RCU_PLL_MUL17                   (PLLMF_4 | CFG0_PLLMF(0))            /*!< PLL clock source multiply by 17 */
#define RCU_PLL_MUL18                   (PLLMF_4 | CFG0_PLLMF(1))            /*!< PLL clock source multiply by 18 */
#define RCU_PLL_MUL19                   (PLLMF_4 | CFG0_PLLMF(2))            /*!< PLL clock source multiply by 19 */
#define RCU_PLL_MUL20                   (PLLMF_4 | CFG0_PLLMF(3))            /*!< PLL clock source multiply by 20 */
#define RCU_PLL_MUL21                   (PLLMF_4 | CFG0_PLLMF(4))            /*!< PLL clock source multiply by 21 */
#define RCU_PLL_MUL22                   (PLLMF_4 | CFG0_PLLMF(5))            /*!< PLL clock source multiply by 22 */
#define RCU_PLL_MUL23                   (PLLMF_4 | CFG0_PLLMF(6))            /*!< PLL clock source multiply by 23 */
#define RCU_PLL_MUL24                   (PLLMF_4 | CFG0_PLLMF(7))            /*!< PLL clock source multiply by 24 */
#define RCU_PLL_MUL25                   (PLLMF_4 | CFG0_PLLMF(8))            /*!< PLL clock source multiply by 25 */
#define RCU_PLL_MUL26                   (PLLMF_4 | CFG0_PLLMF(9))            /*!< PLL clock source multiply by 26 */
#define RCU_PLL_MUL27                   (PLLMF_4 | CFG0_PLLMF(10))           /*!< PLL clock source multiply by 27 */
#define RCU_PLL_MUL28                   (PLLMF_4 | CFG0_PLLMF(11))           /*!< PLL clock source multiply by 28 */
#define RCU_PLL_MUL29                   (PLLMF_4 | CFG0_PLLMF(12))           /*!< PLL clock source multiply by 29 */
#define RCU_PLL_MUL30                   (PLLMF_4 | CFG0_PLLMF(13))           /*!< PLL clock source multiply by 30 */
#define RCU_PLL_MUL31                   (PLLMF_4 | CFG0_PLLMF(14))           /*!< PLL clock source multiply by 31 */

/* CKOUT Clock source selection */
#define CFG0_CKOUTSEL(regval)           (BITS(24,26) & ((uint32_t)(regval) << 24))
#define RCU_CKOUTSRC_NONE               CFG0_CKOUTSEL(0)                     /*!< no clock is selected */
#define RCU_CKOUTSRC_IRC40K             CFG0_CKOUTSEL(2)                     /*!< IRC40K is selected as CK_OUT clock source */
#define RCU_CKOUTSRC_LXTAL              CFG0_CKOUTSEL(3)                     /*!< LXTAL is selected as CK_OUT clock source */
#define RCU_CKOUTSRC_CKSYS              CFG0_CKOUTSEL(4)                     /*!< system clock is selected as CK_OUT clock source */
#define RCU_CKOUTSRC_IRC8M              CFG0_CKOUTSEL(5)                     /*!< IRC8M is selected as CK_OUT clock source */
#define RCU_CKOUTSRC_HXTAL              CFG0_CKOUTSEL(6)                     /*!< HXTAL is selected as CK_OUT clock source */
#define RCU_CKOUTSRC_CKPLL_DIV1         (RCU_CFG0_PLLDV | CFG0_CKOUTSEL(7))  /*!< CK_PLL is selected as CK_OUT clock source */
#define RCU_CKOUTSRC_CKPLL_DIV2         CFG0_CKOUTSEL(7)                     /*!< CK_PLL/2 is selected as CK_OUT clock source */

/* CK_OUT divider */
#define CFG0_CKOUTDIV(regval)           (BITS(28,30) & ((uint32_t)(regval) << 28))
#define RCU_CKOUT_DIV1                  CFG0_CKOUTDIV(0)                     /*!< CK_OUT is divided by 1 */
#define RCU_CKOUT_DIV2                  CFG0_CKOUTDIV(1)                     /*!< CK_OUT is divided by 2 */
#define RCU_CKOUT_DIV4                  CFG0_CKOUTDIV(2)                     /*!< CK_OUT is divided by 4 */
#define RCU_CKOUT_DIV8                  CFG0_CKOUTDIV(3)                     /*!< CK_OUT is divided by 8 */
#define RCU_CKOUT_DIV16                 CFG0_CKOUTDIV(4)                     /*!< CK_OUT is divided by 16 */
#define RCU_CKOUT_DIV32                 CFG0_CKOUTDIV(5)                     /*!< CK_OUT is divided by 32 */
#define RCU_CKOUT_DIV64                 CFG0_CKOUTDIV(6)                     /*!< CK_OUT is divided by 64 */
#define RCU_CKOUT_DIV128                CFG0_CKOUTDIV(7)                     /*!< CK_OUT is divided by 128 */

/* LXTAL drive capability */
#define BDCTL_LXTALDRI(regval)          (BITS(3,4) & ((uint32_t)(regval) << 3))
#define RCU_LXTAL_LOWDRI                BDCTL_LXTALDRI(0)                    /*!< lower driving capability */
#define RCU_LXTAL_MED_LOWDRI            BDCTL_LXTALDRI(1)                    /*!< medium low driving capability */
#define RCU_LXTAL_MED_HIGHDRI           BDCTL_LXTALDRI(2)                    /*!< medium high driving capability */
#define RCU_LXTAL_HIGHDRI               BDCTL_LXTALDRI(3)                    /*!< higher driving capability */

/* RTC clock entry selection */
#define BDCTL_RTCSRC(regval)            (BITS(8,9) & ((uint32_t)(regval) << 8))
#define RCU_RTCSRC_NONE                 BDCTL_RTCSRC(0)                     /*!< no clock is selected */
#define RCU_RTCSRC_LXTAL                BDCTL_RTCSRC(1)                     /*!< LXTAL is selected as RTC clock source */
#define RCU_RTCSRC_IRC40K               BDCTL_RTCSRC(2)                     /*!< IRC40K is selected as RTC clock source */
#define RCU_RTCSRC_HXTAL_DIV_128        BDCTL_RTCSRC(3)                     /*!< HXTAL/128 is selected as RTC clock source */

/* PREDV0 division factor */
#define CFG1_PREDV(regval)              (BITS(0,3) & ((uint32_t)(regval) << 0))
#define RCU_PREDV_DIV1                  CFG1_PREDV(0)                        /*!< PREDV input clock source not divided */
#define RCU_PREDV_DIV2                  CFG1_PREDV(1)                        /*!< PREDV input clock source divided by 2 */
#define RCU_PREDV_DIV3                  CFG1_PREDV(2)                        /*!< PREDV input clock source divided by 3 */
#define RCU_PREDV_DIV4                  CFG1_PREDV(3)                        /*!< PREDV input clock source divided by 4 */
#define RCU_PREDV_DIV5                  CFG1_PREDV(4)                        /*!< PREDV input clock source divided by 5 */
#define RCU_PREDV_DIV6                  CFG1_PREDV(5)                        /*!< PREDV input clock source divided by 6 */
#define RCU_PREDV_DIV7                  CFG1_PREDV(6)                        /*!< PREDV input clock source divided by 7 */
#define RCU_PREDV_DIV8                  CFG1_PREDV(7)                        /*!< PREDV input clock source divided by 8 */
#define RCU_PREDV_DIV9                  CFG1_PREDV(8)                        /*!< PREDV input clock source divided by 9 */
#define RCU_PREDV_DIV10                 CFG1_PREDV(9)                        /*!< PREDV input clock source divided by 10 */
#define RCU_PREDV_DIV11                 CFG1_PREDV(10)                       /*!< PREDV input clock source divided by 11 */
#define RCU_PREDV_DIV12                 CFG1_PREDV(11)                       /*!< PREDV input clock source divided by 12 */
#define RCU_PREDV_DIV13                 CFG1_PREDV(12)                       /*!< PREDV input clock source divided by 13 */
#define RCU_PREDV_DIV14                 CFG1_PREDV(13)                       /*!< PREDV input clock source divided by 14 */
#define RCU_PREDV_DIV15                 CFG1_PREDV(14)                       /*!< PREDV input clock source divided by 15 */
#define RCU_PREDV_DIV16                 CFG1_PREDV(15)                       /*!< PREDV input clock source divided by 16 */

/* deep-sleep mode voltage */
#define DSV_DSLPVS(regval)              (BITS(0,1) & ((uint32_t)(regval) << 0))
#define RCU_DEEPSLEEP_V_0_8             DSV_DSLPVS(0)                        /*!< core voltage is 0.8V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_0_9             DSV_DSLPVS(1)                        /*!< core voltage is 0.9V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_1_0             DSV_DSLPVS(2)                        /*!< core voltage is 1.0V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_1_1             DSV_DSLPVS(3)                        /*!< core voltage is 1.1V in deep-sleep mode */

