CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_rcu.h
/* USART clock source selection */
#define CFG2_USART0SRC(regval)          (BITS(0,1) & ((uint32_t)(regval) << 0))
#define RCU_USARTSRC_HXTAL              CFG2_USART0SRC(0)                    /*!< CK_HXTAL is selected as USART clock source */
#define RCU_USARTSRC_CKSYS              CFG2_USART0SRC(1)                    /*!< CK_SYS is selected as USART clock source */
#define RCU_USARTSRC_LXTAL              CFG2_USART0SRC(2)                    /*!< CK_LXTAL is selected as USART clock source */
#define RCU_USARTSRC_IRC8M              CFG2_USART0SRC(3)                    /*!< CK_IRC8M is selected as USART clock source */

/* CAN clock source selection */
#define CFG2_CAN0SRC(regval)            (BITS(12,13) & ((uint32_t)(regval) << 12))
#define RCU_CANSRC_HXTAL                CFG2_CAN0SRC(0)                      /*!< CK_HXTAL is selected as CAN clock source */
#define RCU_CANSRC_PCLK2                CFG2_CAN0SRC(1)                      /*!< PCLK2 is selected as CAN clock source */
#define RCU_CANSRC_PCLK2_DIV_2          CFG2_CAN0SRC(2)                      /*!< PCLK2/2 is selected as CAN clock source */
#define RCU_CANSRC_IRC8M                CFG2_CAN0SRC(3)                      /*!< CK_IRC8M is selected as CAN clock source */


/* function declarations */
/* peripherals clock configure functions */
/* deinitialize the RCU */
void rcu_deinit(void);
/* enable the peripherals clock */
void rcu_periph_clock_enable(rcu_periph_enum periph);
/* disable the peripherals clock */
void rcu_periph_clock_disable(rcu_periph_enum periph);
/* reset the peripherals */
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset);
/* disable reset the peripheral */
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset);
/* enable the peripherals clock when in sleep mode */
void rcu_periph_clock_sleep_enable(rcu_periph_sleep_enum periph);
/* disable the peripherals clock when in sleep mode */
void rcu_periph_clock_sleep_disable(rcu_periph_sleep_enum periph);
/* reset the BKP domain control register */
void rcu_bkp_reset_enable(void);
/* disable the BKP domain control register reset */
void rcu_bkp_reset_disable(void);

/* system and peripherals clock source, system reset configure functions */
/* configure the system clock source */
void rcu_system_clock_source_config(uint32_t ck_sys);
/* get the system clock source */
uint32_t rcu_system_clock_source_get(void);
/* configure the AHB prescaler selection */
void rcu_ahb_clock_config(uint32_t ck_ahb);
/* configure the APB1 prescaler selection */
void rcu_apb1_clock_config(uint32_t ck_apb1);
/* configure the APB2 prescaler selection */
void rcu_apb2_clock_config(uint32_t ck_apb2);
/* configure the CK_OUT clock source and divider */
void rcu_ckout_config(uint32_t ckout_src, uint32_t ckout_div);
/* configure the PLL clock source selection and PLL multiply factor */
void rcu_pll_config(uint32_t pll_src, uint32_t pll_mul);
/* enable double PLL clock */
void rcu_double_pll_enable(void);
/* disable double PLL clock */
void rcu_double_pll_disable(void);
/* enable RCU system reset */
void rcu_system_reset_enable(uint32_t reset_source);
/* disable RCU system reset */
void rcu_system_reset_disable(uint32_t reset_source);
/* configure the ADC division factor */
void rcu_adc_clock_config(uint32_t adc_psc);
/* configure the RTC clock source selection */
void rcu_rtc_clock_config(uint32_t rtc_clock_source);
/* configure the USART clock source selection */
void rcu_usart_clock_config(uint32_t usart_periph, uint32_t usart_clock_source);
/* configure the CAN clock source selection */
void rcu_can_clock_config(uint32_t can_periph, uint32_t can_clock_source);

/* LXTAL, IRC8M, PLL and other oscillator configure functions */
/* configure the LXTAL drive capability */
void rcu_lxtal_drive_capability_config(uint32_t lxtal_dricap);
/* wait for oscillator stabilization flags is SET or oscillator startup is timeout */
ErrStatus rcu_osci_stab_wait(rcu_osci_type_enum osci);
/* turn on the oscillator */
void rcu_osci_on(rcu_osci_type_enum osci);
/* turn off the oscillator */
void rcu_osci_off(rcu_osci_type_enum osci);
/* enable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it */
void rcu_osci_bypass_mode_enable(rcu_osci_type_enum osci);
/* disable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it */
void rcu_osci_bypass_mode_disable(rcu_osci_type_enum osci);
/* configure the HXTAL frequency scale select */
void rcu_hxtal_frequency_scale_select(uint32_t hxtal_scal);
/* configure the HXTAL divider used as input of PLL */
void rcu_hxtal_prediv_config(uint32_t hxtal_prediv);
/* set the IRC8M adjust value */
void rcu_irc8m_adjust_value_set(uint32_t irc8m_adjval);

/* clock monitor configure functions */
/* enable the HXTAL clock monitor */
void rcu_hxtal_clock_monitor_enable(void);
/* disable the HXTAL clock monitor */
void rcu_hxtal_clock_monitor_disable(void);
/* enable the LXTAL clock monitor */
void rcu_lxtal_clock_monitor_enable(void);
/* disable the LXTAL clock monitor */
void rcu_lxtal_clock_monitor_disable(void);
/* enable the PLL clock monitor */
void rcu_pll_clock_monitor_enable(void);
/* disable the PLL clock monitor */
void rcu_pll_clock_monitor_disable(void);

/* voltage configure and clock frequency get functions */
/* unlock the voltage key */
void rcu_voltage_key_unlock(void);
/* set the deep sleep mode voltage */
void rcu_deepsleep_voltage_set(uint32_t dsvol);
/* get the system clock, bus and peripheral clock frequency */
uint32_t rcu_clock_freq_get(rcu_clock_freq_enum clock);

/* flag & interrupt functions */
/* get the clock stabilization and peripheral reset flags */
FlagStatus rcu_flag_get(rcu_flag_enum flag);
/* clear the reset flag */
void rcu_all_reset_flag_clear(void);
/* get the clock stabilization interrupt and ckm flags */
FlagStatus rcu_interrupt_flag_get(rcu_int_flag_enum int_flag);
/* clear the interrupt flags */
void rcu_interrupt_flag_clear(rcu_int_flag_clear_enum int_flag);
/* enable the stabilization interrupt */
void rcu_interrupt_enable(rcu_int_enum interrupt);
/* disable the stabilization interrupt */
void rcu_interrupt_disable(rcu_int_enum interrupt);
#endif /* GD32A50X_RCU_H */
